In [1]:
import numpy as np
import pandas as pd
dates = pd.date_range('20130101', periods=6)
df = pd.DataFrame(np.random.randn(6,4), index=dates, columns=list('ABCD'))
df

                   A         B         C         D
2013-01-01 -0.232018  0.525984  1.117835 -0.393862
2013-01-02  1.316824  1.016015  0.516188 -0.396367
2013-01-03 -0.294642  2.589124 -0.826576  0.830083
2013-01-04 -1.541055  1.606769  0.519220  2.426087
2013-01-05  1.516875 -0.227867 -0.321480  1.708790
2013-01-06 -0.411006 -0.982008  1.250035 -1.159732

In [2]:
df2 = pd.DataFrame({'A': 1.,
                        'B': pd.Timestamp('20130102'),
                        'C': pd.Series(1, index=list(range(4)), dtype='float32'),
                        'D': np.array([3] * 4, dtype='int32'),
                        'E': pd.Categorical(["test", "train", "test", "train"]),
                        'F': 'foo'})

In [3]:
df3 = pd.DataFrame({'A': 1.0,
            'B': pd.Timestamp('20130102'),
            'C': pd.Series(1, index=list(range(4)), dtype='float32'),
            'D': np.array([3] * 4, dtype='int32'),
            'E': pd.Categorical(["test", "train", "test", "train"]),
            'F': 'foo'})
df3

     A          B    C  D      E    F
0  1.0 2013-01-02  1.0  3   test  foo
1  1.0 2013-01-02  1.0  3  train  foo
2  1.0 2013-01-02  1.0  3   test  foo
3  1.0 2013-01-02  1.0  3  train  foo

In [4]:
df["A"] # or DF.A

2013-01-01   -0.232018
2013-01-02    1.316824
2013-01-03   -0.294642
2013-01-04   -1.541055
2013-01-05    1.516875
2013-01-06   -0.411006
Freq: D, Name: A, dtype: float64

In [5]:
df[0:3]

                   A         B         C         D
2013-01-01 -0.232018  0.525984  1.117835 -0.393862
2013-01-02  1.316824  1.016015  0.516188 -0.396367
2013-01-03 -0.294642  2.589124 -0.826576  0.830083

In [6]:
df.loc["2013-01-01"]

A   -0.232018
B    0.525984
C    1.117835
D   -0.393862
Name: 2013-01-01 00:00:00, dtype: float64

In [7]:
df.loc[:,["A","B"]]

                   A         B
2013-01-01 -0.232018  0.525984
2013-01-02  1.316824  1.016015
2013-01-03 -0.294642  2.589124
2013-01-04 -1.541055  1.606769
2013-01-05  1.516875 -0.227867
2013-01-06 -0.411006 -0.982008

In [8]:
df.loc['20130102':'20130104',["A","B"]]

                   A         B
2013-01-02  1.316824  1.016015
2013-01-03 -0.294642  2.589124
2013-01-04 -1.541055  1.606769

In [9]:
df.loc['20130102', ['A', 'B']]

A    1.316824
B    1.016015
Name: 2013-01-02 00:00:00, dtype: float64

In [10]:
df.iloc[3]

A   -1.541055
B    1.606769
C    0.519220
D    2.426087
Name: 2013-01-04 00:00:00, dtype: float64

In [11]:
df.iloc[3:5, 0:2]

                   A         B
2013-01-04 -1.541055  1.606769
2013-01-05  1.516875 -0.227867

In [12]:
df.iloc[1:3, :]

                   A         B         C         D
2013-01-02  1.316824  1.016015  0.516188 -0.396367
2013-01-03 -0.294642  2.589124 -0.826576  0.830083

In [13]:
df = pd.DataFrame({'string': list('abc'),
                       'int64': list(range(1, 4)),
                       'uint8': np.arange(3, 6).astype('u1'),
                       'float64': np.arange(4.0, 7.0),
                       'bool1': [True, False, True],
                       'bool2': [False, True, False],
                       'dates': pd.date_range('now', periods=3),
                       'category': pd.Series(list("ABC")).astype('category')})

In [14]:
df.select_dtypes(include=[bool])

   bool1  bool2
0   True  False
1  False   True
2   True  False

In [15]:
df[df['float64'] >= 5]

,string,int64,uint8,float64,bool1,bool2,dates,category
1,b,2,4,5.0,False,True,2021-09-22 10:26:47.284892,B
2,c,3,5,6.0,True,False,2021-09-23 10:26:47.284892,C

In [16]:
df2 = df.copy()
df2

,string,int64,uint8,float64,bool1,bool2,dates,category
0,a,1,3,4.0,True,False,2021-09-21 10:26:47.284892,A
1,b,2,4,5.0,False,True,2021-09-22 10:26:47.284892,B
2,c,3,5,6.0,True,False,2021-09-23 10:26:47.284892,C

In [17]:
df2['E'] = ['one', 'two', 'three'] # add a column
df2

,string,int64,uint8,float64,bool1,bool2,dates,category,E
0,a,1,3,4.0,True,False,2021-09-21 10:26:47.284892,A,one
1,b,2,4,5.0,False,True,2021-09-22 10:26:47.284892,B,two
2,c,3,5,6.0,True,False,2021-09-23 10:26:47.284892,C,three

In [18]:
df3[df3['E'].isin(['one','two'])]

Empty DataFrame
Columns: [A, B, C, D, E, F]
Index: []

In [29]:
df.iat[0, 1] = -2

In [27]:
df.at[0, 'float64'] = -10

In [30]:
df.loc[:, 'uint8'] = np.array([50] * len(df))
df

,string,int64,uint8,float64,bool1,bool2,dates,category
0,a,-2,50,-10.0,True,False,2021-09-21 10:26:47.284892,A
1,b,2,50,5.0,False,True,2021-09-22 10:26:47.284892,B
2,c,3,50,6.0,True,False,2021-09-23 10:26:47.284892,C